# GetEntry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntryError..::..GetEntry Method
KeyBasedTreeEntryError Class See Also
---
Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntry GetEntry()
```

Visual Basic
---
```text
Public Function GetEntry As KeyBasedTreeEntry
```

Visual C++
---
```text
public:
KeyBasedTreeEntry^ GetEntry()
```

# ### Return Value
A copy of the KeyBasedTreeEntry.
# See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace